БухЭксп/InformationRegisters/Отчетность24БРОЗапросы.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>Отчетность24БРОЗапросы</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Получатель</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>40</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Отправитель</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>40</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ИДОтчета</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>80</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ИДРедакцииОтчета</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>80</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ИмяТипа</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>120</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ТелоЗапроса</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Подтверждено</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.Организация</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПериодОтчета</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>45</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ТекстДополнения</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>120</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Отклонено</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ДатаПолученияЗапроса</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Идентификатор</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>40</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

БухЭксп/InformationRegisters/Отчетность24БРОПодключения.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>Отчетность24БРОПодключения</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Имя</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Отправитель</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ТребоватьПодтверждениеПользователя</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Госорганы</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>АдресПолучателя</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Получатель</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>40</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

БухЭксп/InformationRegisters/Отчетность24БРОЗапросы/Forms/ФормаПодтвержденияОтветаНаЗапрос/Ext/Form/Module.bsl
// @strict-types

#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Запросы = Неопределено; // см. СформироватьТаблицуЗапросов.Запросы
	Параметры.Свойство("ЗапросыПодтверждения", Запросы);
	Параметры.Свойство("ОбработатьСразу", ОбработатьСразу);
	
	Если Запросы = Неопределено Тогда
		Отказ = Истина;
		Возврат;
	КонецЕсли;
	
	СформироватьТаблицуЗапросов(Запросы);

КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	НастроитьОтображение();

	ПодключениеОбработчиковУведомлений();
	
КонецПроцедуры

&НаКлиенте
Процедура ПриПовторномОткрытии()
	ОбновитьСписокЗапросов();
	НастроитьОтображение();
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ТаблицаЗапросовОрганизация1Нажатие(Элемент, СтандартнаяОбработка)

	ТекущиеДанные = ТаблицаЗапросов[0];
	Если ТекущиеДанные <> Неопределено И ЗначениеЗаполнено(ТекущиеДанные.Организация) Тогда
		ПоказатьЗначение(, ТекущиеДанные.Организация);
	КонецЕсли;
	СтандартнаяОбработка = Ложь;

КонецПроцедуры

&НаКлиенте
Процедура ТаблицаЗапросовПриложениеНажатие(Элемент, СтандартнаяОбработка)

	СтрокаТаблицы = ТаблицаЗапросов[0];
		
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("Ключ", ПолучитьКлючЗаписиНастройки(СтрокаТаблицы.Отправитель));
	ОткрытьФорму("РегистрСведений.Отчетность24БРОПодключения.ФормаЗаписи", ПараметрыФормы, ЭтотОбъект,
		УникальныйИдентификатор, , , , РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);

	СтандартнаяОбработка = Ложь;

КонецПроцедуры

&НаКлиенте
Процедура ТаблицаЗапросовПриложениеОбработкаНавигационнойСсылки(Элемент, НавигационнаяСсылкаФорматированнойСтроки, СтандартнаяОбработка)
	ОткрытьПодключение();		
	СтандартнаяОбработка = Ложь;
КонецПроцедуры
#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура Подтвердить(Команда)
	
	Если ТаблицаЗапросов.Количество() > 0 Тогда
		ТаблицаЗапросов[0].Отметка = Истина;	
	КонецЕсли;
	
	ПодтвердитьЗапросы();
	
	Если ТаблицаЗапросов.Количество() = 0 Тогда
		Закрыть();
	Иначе
		НастроитьОтображение();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура Отклонить(Команда) 
	
	Если ТаблицаЗапросов.Количество() > 0 Тогда
		ТаблицаЗапросов[0].Отметка = Ложь;	
	КонецЕсли;
	
	ПодтвердитьЗапросы();
	
	Если ТаблицаЗапросов.Количество() = 0 Тогда
		Закрыть();
	Иначе
		НастроитьОтображение();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура СнятьФлажки(Команда)
	
	Для Каждого СтрокаТаблицы Из ТаблицаЗапросов Цикл
		СтрокаТаблицы.Отметка = Ложь;	
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьФлажки(Команда)
	
	Для Каждого СтрокаТаблицы Из ТаблицаЗапросов Цикл
		СтрокаТаблицы.Отметка = Истина;	
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура НастроитьОтображение()
	
	Отчетность24БРОКлиент.ЗакрытьДубликатыФормы(ЭтотОбъект);

	Если ТаблицаЗапросов.Количество() = 0 Тогда
		Закрыть();
	КонецЕсли;
	
	СтрокаТЗ = ТаблицаЗапросов[0];
	
	Отчет = СтрокаТЗ.ПредставлениеОтчета;
	Организация = СтрокаТЗ.Организация;
	ДополнениеТекст = СтрокаТЗ.ДополнениеТекст;
	ПериодОтчета = СтрокаТЗ.ПериодОтчета;
	Приложение = СтрокаТЗ.ИмяПодключения;

	Элементы.ДополнениеТекст.Видимость = ЗначениеЗаполнено(СтрокаТЗ.ДополнениеТекст);

	ТекущиеДанныеЗапроса = СтрокаТЗ;
	Если ТекущиеДанныеЗапроса.ИмяТипа = "СправочникОбъект.ФизическиеЛица" Или ТекущиеДанныеЗапроса.ИмяТипа
		= "СправочникОбъект.БанковскиеСчета" Тогда

		ЭтоБанковскиеСчета = ТекущиеДанныеЗапроса.ИмяТипа = "СправочникОбъект.БанковскиеСчета";
		Заголовок = СтрШаблон(НСтр("ru='Подтвердить отправку данных по %1?'"), ?(ЭтоБанковскиеСчета, НСтр(
			"ru='банковским счетам'"), НСтр("ru='сотрудникам'")));
		ТекущиеДанныеЗапроса.ПредставлениеОтчета = ?(ЭтоБанковскиеСчета, НСтр("ru='Банковские счета'"), НСтр(
			"ru='Сотрудники'"));
	КонецЕсли;

	КоличествоЗапросовВОчереди = ТаблицаЗапросов.Количество() - 1;
	Если КоличествоЗапросовВОчереди > 0 Тогда
		СтрокаЗапрос = ПолучитьСклонениеПоЧислу("запрос", КоличествоЗапросовВОчереди);
		Элементы.ДекорацияЕщеВОчереди.Заголовок = СтрШаблон(НСтр("ru = 'Еще %1 в очереди'"), СтрокаЗапрос);
		Элементы.ДекорацияОтступКнопок.Ширина = Цел(СтрДлина(Элементы.ДекорацияЕщеВОчереди.Заголовок)/2);
		
		Если КоличествоЗапросовВОчереди = 1 Тогда
			Элементы.ДекорацияОтступКнопок.Ширина = Элементы.ДекорацияОтступКнопок.Ширина + 4;
		ИначеЕсли КоличествоЗапросовВОчереди < 10 Тогда
			Элементы.ДекорацияОтступКнопок.Ширина = Элементы.ДекорацияОтступКнопок.Ширина + 5;
		Иначе
			Элементы.ДекорацияОтступКнопок.Ширина = Элементы.ДекорацияОтступКнопок.Ширина + 6;
		КонецЕсли;
		
	Иначе
		Элементы.ДекорацияЕщеВОчереди.Заголовок = "";
		Элементы.ДекорацияОтступКнопок.Ширина = 0;
	КонецЕсли;
	

КонецПроцедуры

&НаСервере
Функция ПолучитьСклонениеПоЧислу(Текст, Количество)
	Возврат ПолучитьСклоненияСтрокиПоЧислу(Текст, Количество)[0];
КонецФункции

&НаСервере
Процедура ОбновитьСписокЗапросов()
	
	ЗапросыПодтверждения = 
		ИнтеграцияСОтчетность24ВызовСервера.ПолучитьЗапросыИнтеграцииДляФормыПодтверждения();
	
	Если ЗапросыПодтверждения <> Неопределено Тогда
		ТекущийПользователь = Пользователи.ТекущийПользователь();
		ЗапросыИнтеграцииДляПользователя = ЗапросыПодтверждения.Получить(ТекущийПользователь);
		Если ЗапросыИнтеграцииДляПользователя = Неопределено Тогда
			ЗапросыИнтеграцииДляПользователя = Новый Массив;	
		КонецЕсли;
		ЗапросыИнтеграцииДляПользователяДляВсех = ЗапросыПодтверждения.Получить("ВсеПользователи");
		Если ЗапросыИнтеграцииДляПользователяДляВсех <> Неопределено Тогда
			Для Каждого ЗапросИнтеграции Из ЗапросыИнтеграцииДляПользователяДляВсех Цикл
				ЗапросыИнтеграцииДляПользователя.Добавить(ЗапросИнтеграции);
			КонецЦикла;
		КонецЕсли;
		Если ЗапросыИнтеграцииДляПользователя.Количество() > 0 Тогда
			СформироватьТаблицуЗапросов(ЗапросыИнтеграцииДляПользователя);
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

// Формирует таблицу поступивших запросов.
// 
// Параметры:
//  Запросы - Массив Из Структура:
//  * Идентификатор    - Строка
//  * Получатель       - Строка
//  * Отправитель      - Строка
//  * ИДОтчета         - Строка
//  * ИДРедакцииОтчета - Строка
//  * ИмяТипа          - Строка
//  * ИмяПодключения   - Строка
//  * АдресПолучателя  - Строка
//  * Организация      - СправочникСсылка.Организации
//  * ПериодОтчета     - Строка
&НаСервере
Процедура СформироватьТаблицуЗапросов(Запросы)
	
	Элементы.ДекорацияЕщеВОчереди.Заголовок = "";
	
	Отправитель = Неопределено;
	Для Каждого ОтложенныйЗапрос Из Запросы Цикл
		
		СтрокиЗапроса = ТаблицаЗапросов.НайтиСтроки(Новый Структура("Идентификатор", ОтложенныйЗапрос.Идентификатор));
		Если СтрокиЗапроса.Количество() > 0 Тогда
			Продолжить;
		КонецЕсли;
		
		НоваяСтрока = ТаблицаЗапросов.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, ОтложенныйЗапрос);

		Если ЗначениеЗаполнено(НоваяСтрока.Отправитель) Тогда
			МенеджерНастройки = РегистрыСведений.Отчетность24БРОПодключения.СоздатьМенеджерЗаписи();
			МенеджерНастройки.Получатель = НоваяСтрока.Отправитель;
			УстановитьПривилегированныйРежим(Истина);
			МенеджерНастройки.Прочитать();
			УстановитьПривилегированныйРежим(Ложь);
			Если МенеджерНастройки.Выбран() Тогда
				НоваяСтрока.ИмяПодключения = МенеджерНастройки.Имя;
			КонецЕсли;
		КонецЕсли;

		Если ЗначениеЗаполнено(НоваяСтрока.ДополнениеТекст) Тогда
			ЕстьДополнениеТекст = Истина;
		КонецЕсли;

		НоваяСтрока.Отметка = Истина;
		Если ЗначениеЗаполнено(НоваяСтрока.ИДОтчета) Тогда
			МетаданныеОтчета = Метаданные.Отчеты.Найти(НоваяСтрока.ИДОтчета);
		ИначеЕсли ЗначениеЗаполнено(НоваяСтрока.ИмяТипа) Тогда
			МетаданныеОтчета = Неопределено;
			МетаданныеОтчета = Метаданные.НайтиПоПолномуИмени(СтрЗаменить(НоваяСтрока.ИмяТипа, "Объект.", "."));
		КонецЕсли;
		Если МетаданныеОтчета <> Неопределено Тогда
			НоваяСтрока.ПредставлениеОтчета = МетаданныеОтчета.Представление();
		КонецЕсли;
		Если НоваяСтрока.ИмяТипа = "СправочникОбъект.ФизическиеЛица" Тогда
			НоваяСтрока.ПредставлениеОтчета = НСтр("ru='Сотрудники'");
		ИначеЕсли НоваяСтрока.ИмяТипа = "СправочникОбъект.БанковскиеСчета" Тогда
			НоваяСтрока.ПредставлениеОтчета = НСтр("ru='Банковские счета'");
		КонецЕсли;

		Если СтрНачинаетсяС(НоваяСтрока.АдресПолучателя, "http") Тогда
			НоваяСтрока.АдресОблачная = НоваяСтрока.АдресПолучателя;
			ЕстьОблачная = Истина;
		Иначе
			МассивЧастей = СтрРазделить(НоваяСтрока.АдресПолучателя, """");
			Если МассивЧастей.Количество() > 3 Тогда
				НоваяСтрока.ИмяСервераБазы = МассивЧастей[1];
				НоваяСтрока.ИмяБазы = МассивЧастей[3];
				ЕстьСерверная = Истина;
			Иначе
				НоваяСтрока.ПутьФайловойБазы = МассивЧастей[1];
				ЕстьФайловая = Истина;
			КонецЕсли;
		КонецЕсли;
		Если Отправитель <> Неопределено И Отправитель <> НоваяСтрока.Отправитель Тогда
			РазныеОтправители = Истина;
		КонецЕсли;
		Отправитель = НоваяСтрока.Отправитель;
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура ОтправитьУведомлениеОПодтверждении(Идентификатор)
	СистемнаяИнформация = Новый СистемнаяИнформация;
	Если ОбщегоНазначенияКлиентСервер.СравнитьВерсии("8.3.26.0", СистемнаяИнформация.ВерсияПриложения) <= 0 Тогда
		//@skip-check module-unused-local-variable  - используется в ВыполнитьВБезопасномРежиме
		ИмяУведомления = Отчетность24БРОКлиентСервер.ИмяУведомленияУдалениеЗапросаНаПодтвержение();
		ДанныеСообщения = Новый Структура;
		ДанныеСообщения.Вставить("Идентификатор", Идентификатор);
		
		УстановитьБезопасныйРежим(Истина);
		// АПК:488-выкл Поддержка новых методов платформы (исполняемый код безопасен)
		// Не нарушает безопасность информации, так как вычисляется фиксированная строка, 
		// содержащая только вызов метода платформы.
		ПлатформаУведомленияКлиента = Вычислить("УведомленияКлиента"); 
		// АПК:488-вкл
		//@skip-check dynamic-access-method-not-found
		ПлатформаУведомленияКлиента.ОтправитьУведомление(ИмяУведомления, ДанныеСообщения);
		УстановитьБезопасныйРежим(Ложь);
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура ПодтвердитьЗапросы()
	
	ЗапросНаУдаление = Истина;
	
	Если ТаблицаЗапросов.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	СтрокаТаблицы = ТаблицаЗапросов[0];
	МенеджерЗаписи = РегистрыСведений.Отчетность24БРОЗапросы.СоздатьМенеджерЗаписи();
	МенеджерЗаписи.Идентификатор = СтрокаТаблицы.Идентификатор;
	МенеджерЗаписи.Прочитать();

	МенеджерЗаписи.Подтверждено = СтрокаТаблицы.Отметка;
	МенеджерЗаписи.Отклонено = Не СтрокаТаблицы.Отметка;
	МенеджерЗаписи.Записать();
	
	ОтправитьУведомлениеОПодтверждении(СтрокаТаблицы.Идентификатор);

	ТаблицаЗапросов.Удалить(0);
	
	// поиск дубликатов запроса отправленных ранее
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	ЗапросыПодтверждения.Идентификатор КАК Идентификатор
		|ИЗ
		|	РегистрСведений.Отчетность24БРОЗапросы КАК ЗапросыПодтверждения
		|ГДЕ НЕ Подтверждено И НЕ Отклонено
		|	И ЗапросыПодтверждения.Получатель = &Получатель
		|	И ЗапросыПодтверждения.Отправитель = &Отправитель
		|	И ЗапросыПодтверждения.ИДОтчета = &ИДОтчета
		|	И ЗапросыПодтверждения.ИДРедакцииОтчета = &ИДРедакцииОтчета
		|	И ЗапросыПодтверждения.ИмяТипа = &ИмяТипа
		|	И ЗапросыПодтверждения.Организация = &Организация
		|	И ЗапросыПодтверждения.ПериодОтчета = &ПериодОтчета";
	
	Запрос.УстановитьПараметр("ПериодОтчета", МенеджерЗаписи.ПериодОтчета);
	Запрос.УстановитьПараметр("ИмяТипа", МенеджерЗаписи.ИмяТипа);
	Запрос.УстановитьПараметр("Отправитель", МенеджерЗаписи.Отправитель);
	Запрос.УстановитьПараметр("ИДРедакцииОтчета", МенеджерЗаписи.ИДРедакцииОтчета);
	Запрос.УстановитьПараметр("ИДОтчета", МенеджерЗаписи.ИДОтчета);
	Запрос.УстановитьПараметр("Организация", МенеджерЗаписи.Организация);
	Запрос.УстановитьПараметр("Получатель", МенеджерЗаписи.Получатель);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ИмяИдентификатор = "Идентификатор";
	Выборка = РезультатЗапроса.Выбрать();
	Пока Выборка.Следующий() Цикл
		
		ИдентификаторЗапроса = Строка(Выборка[ИмяИдентификатор]);
		ОтправитьУведомлениеОПодтверждении(ИдентификаторЗапроса);

		// подтверждение всех однотипных запросов
		МенеджерЗаписи = РегистрыСведений.Отчетность24БРОЗапросы.СоздатьМенеджерЗаписи();
		МенеджерЗаписи.Идентификатор = ИдентификаторЗапроса;
		МенеджерЗаписи.Прочитать();

		МенеджерЗаписи.Подтверждено = СтрокаТаблицы.Отметка;
		МенеджерЗаписи.Отклонено = Не СтрокаТаблицы.Отметка;
		МенеджерЗаписи.Записать();
		
		СтрокиТЗ = ТаблицаЗапросов.НайтиСтроки(Новый Структура("Идентификатор", ИдентификаторЗапроса));
		Для Каждого СтрокаТЗ Из СтрокиТЗ Цикл
			ТаблицаЗапросов.Удалить(СтрокаТЗ);
		КонецЦикла;
		
	КонецЦикла;

	НаименованиеЗадания = НСтр("ru = 'Интеграция с приложением 1С:Отчетность 24. Обработка отложенных запросов'");

	ПараметрыВыполнения = ДлительныеОперации.ПараметрыВыполненияВФоне(УникальныйИдентификатор);
	ПараметрыВыполнения.НаименованиеФоновогоЗадания = НаименованиеЗадания;
	ПараметрыВыполнения.ОжидатьЗавершение = 0;
	ИмяСвойстваЭтоФункция = "ЭтоФункция";
	Если ПараметрыВыполнения.Свойство(ИмяСвойстваЭтоФункция) 
		И ТипЗнч(ПараметрыВыполнения[ИмяСвойстваЭтоФункция]) = Тип("Строка") Тогда
			
		ПараметрыВыполнения[ИмяСвойстваЭтоФункция] = "Процедура";
	ИначеЕсли ПараметрыВыполнения.Свойство(ИмяСвойстваЭтоФункция) 
		И ТипЗнч(ПараметрыВыполнения[ИмяСвойстваЭтоФункция]) = Тип("Булево") Тогда
			
		//@skip-check statement-type-change
		ПараметрыВыполнения[ИмяСвойстваЭтоФункция] = Ложь;
	Иначе
		//@skip-check structure-key-modification
		ПараметрыВыполнения.Вставить("ЭтоФункция", Ложь);
	КонецЕсли;
	
	ПараметрыВыполнения.ЗапуститьВФоне = ОбработатьСразу = Ложь;
	
	ДлительныеОперации.ВыполнитьВФоне("ИнтеграцияСОтчетность24.ОбработатьОтложенныеЗапросы", 
		Новый Массив(), ПараметрыВыполнения);
	
КонецПроцедуры

&НаКлиенте
Процедура ПодключениеОбработчиковУведомлений()
		
	СистемнаяИнформация = Новый СистемнаяИнформация;
	Если ОбщегоНазначенияКлиентСервер.СравнитьВерсии("8.3.26.0", СистемнаяИнформация.ВерсияПриложения) <= 0 Тогда
		//@skip-check module-unused-local-variable - используется в ВыполнитьВБезопасномРежиме
		ИмяУведомления = Отчетность24БРОКлиентСервер.ИмяУведомленияУдалениеЗапросаНаПодтвержение();
		//@skip-check module-unused-local-variable - используется в ВыполнитьВБезопасномРежиме
		Обработчик = Новый ОписаниеОповещения("ПриПолученииКомандыУдаленияЗапросаНаПодвержение", ЭтотОбъект);
		
		// АПК:488-выкл Поддержка новых методов платформы (исполняемый код безопасен)
		// Не нарушает безопасность информации, так как вычисляется фиксированная строка, 
		// содержащая только вызов метода платформы.
		ПлатформаУведомленияКлиента = Вычислить("УведомленияКлиента"); 
		// АПК:488-вкл
		//@skip-check dynamic-access-method-not-found
		ПлатформаУведомленияКлиента.ПодключитьОбработчик(ИмяУведомления, Обработчик);
	
	КонецЕсли;

КонецПроцедуры


// Обработчик получения уведомления о получении сообщения из шины отчетности.
// 
// Параметры:
//  ДанныеСообщения - Структура:
//  * Идентификатор - Строка - Идентификатор запроса для удаления
//  ДополнительныеПараметры - Неопределено
&НаКлиенте
Процедура ПриПолученииКомандыУдаленияЗапросаНаПодвержение(ДанныеСообщения, ДополнительныеПараметры = Неопределено) Экспорт

	Если ЗапросНаУдаление Тогда
		Возврат;
	КонецЕсли;
	Если ЗначениеЗаполнено(ДанныеСообщения.Идентификатор) Тогда

		Если УдалитьЗапросИзТаблицыЗапросов(ДанныеСообщения.Идентификатор) Тогда
			Закрыть();
			Возврат;
		КонецЕсли;
		
		НастроитьОтображение();
		
	КонецЕсли;

КонецПроцедуры

&НаСервере
Функция УдалитьЗапросИзТаблицыЗапросов(Идентификатор)

	СтрокиТЗ = ТаблицаЗапросов.НайтиСтроки(Новый Структура("Идентификатор", Идентификатор));
	Для Каждого СтрокаТЗ Из СтрокиТЗ Цикл
		ТаблицаЗапросов.Удалить(СтрокаТЗ);
	КонецЦикла;
	
	Возврат ТаблицаЗапросов.Количество() = 0;
	
КонецФункции

&НаКлиенте
Процедура ОткрытьПодключение()

	МассивПолучателей = Новый Массив; // Массив Из Строка
	Для Каждого СтрокаТаблицы Из ТаблицаЗапросов Цикл
		Если ЗначениеЗаполнено(СтрокаТаблицы.Отправитель) 
			И МассивПолучателей.Найти(СтрокаТаблицы.Отправитель) = Неопределено Тогда
			МассивПолучателей.Добавить(СтрокаТаблицы.Отправитель);	
		КонецЕсли;
	КонецЦикла;  
	
	Если МассивПолучателей.Количество() = 1 Тогда        
		ПараметрыФормы = Новый Структура;
		ПараметрыФормы.Вставить("Ключ", ПолучитьКлючЗаписиНастройки(МассивПолучателей[0]));
		ОткрытьФорму("РегистрСведений.Отчетность24БРОПодключения.ФормаЗаписи", 
			ПараметрыФормы, 
			ЭтотОбъект, 
			УникальныйИдентификатор, , , , 
			РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);	
	Иначе	
		ОткрытьФорму("РегистрСведений.Отчетность24БРОПодключения.ФормаСписка", 
			, 
			ЭтотОбъект, 
			УникальныйИдентификатор, , , , 
			РежимОткрытияОкнаФормы.БлокироватьОкноВладельца); 
	КонецЕсли;
			
КонецПроцедуры

&НаСервере
Функция ПолучитьКлючЗаписиНастройки(Получатель)

	Возврат РегистрыСведений.Отчетность24БРОПодключения.СоздатьКлючЗаписи(Новый Структура("Получатель", Получатель));
	
КонецФункции

#КонецОбласти
